load-tests/normal-flow.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://staging.procelltherapies.com
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 500
  ensure:
      thresholds:
        - http.response_time.p99: 500
        - http.response_time.p95: 400
scenarios:
  - flow:
      - loop:
        - get:
            url: "/"
        - get:
            url: "/clinical-studies/"
        - get:
            url: "/product/shop/"
        - get:
            url: "/product/product-details/63/"
        - get:
            url: "/product/product-details/41449/"
        - get:
            url: "/product/product-details/41506/"
        - get:
            url: "/product/product-details/41505/"
        - get:
            url: "/contact/"
        - get:
            url: "/workshop/"
        - get:
            url: "/faq/"
        - get:
            url: "/results/"
        count: 2